## 12.1 JSON 파일 읽고 쓰기

In [1]:
import pandas as pd

In [2]:
nobel = pd.read_json("../../DATA/nobel.json")
nobel.head()

                                              prizes
0  {'year': '2019', 'category': 'chemistry', 'lau...
1  {'year': '2019', 'category': 'economics', 'lau...
2  {'year': '2019', 'category': 'literature', 'la...
3  {'year': '2019', 'category': 'peace', 'laureat...
4  {'year': '2019', 'category': 'physics', 'overa...

In [3]:
type(nobel.loc[2, 'prizes'])

dict

In [4]:
chemistry_2019 = nobel.loc[0, "prizes"]
chemistry_2019

{'year': '2019',
 'category': 'chemistry',
 'laureates': [{'id': '976',
   'firstname': 'John',
   'surname': 'Goodenough',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'},
  {'id': '977',
   'firstname': 'M. Stanley',
   'surname': 'Whittingham',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'},
  {'id': '978',
   'firstname': 'Akira',
   'surname': 'Yoshino',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'}]}

In [5]:
type(chemistry_2019)

dict

In [6]:
pd.json_normalize(data=chemistry_2019)

   year   category                                          laureates
0  2019  chemistry  [{'id': '976', 'firstname': 'John', 'surname':...

In [7]:
pd.json_normalize(chemistry_2019, record_path="laureates")

,id,firstname,surname,motivation,share
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3

In [8]:
pd.json_normalize(chemistry_2019, record_path="laureates", meta=["year", "category"])

,id,firstname,surname,motivation,share,year,category
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3,2019,chemistry
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3,2019,chemistry
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3,2019,chemistry

In [9]:
# KeyError: "Key 'laureates' not found. If specifying a record_path, all elements of data should have the path."
# pd.json_normalize(
#     data = nobel["prizes"],
#     record_path = "laureates",
#     meta = ["year", "category"]
# )

* 딕셔너리 setdefault() 메서드

In [10]:
cheese_consumption = {
    "France": 57.9,
    "Germany": 53.2,
    "Luxembourg": 53.2
}

In [11]:
cheese_consumption.setdefault("France", 100)

57.9

In [12]:
cheese_consumption.setdefault("Italy", 48)

48

In [13]:
cheese_consumption

{'France': 57.9, 'Germany': 53.2, 'Luxembourg': 53.2, 'Italy': 48}

* prizes Series에서 laureates 키가 없는 행에 laureates 추가

In [14]:
def add_laureates_key(entry):
    entry.setdefault("laureates", [])

nobel["prizes"].apply(add_laureates_key)

0      None
1      None
2      None
3      None
4      None
       ...
641    None
642    None
643    None
644    None
645    None
Name: prizes, Length: 646, dtype: object

In [15]:
winners = pd.json_normalize(
    data = nobel["prizes"],
    record_path = "laureates",
    meta = ["year", "category"]
)
winners

,id,firstname,surname,motivation,share,year,category
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3,2019,chemistry
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3,2019,chemistry
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3,2019,chemistry
3,982,Abhijit,Banerjee,"""for their experimental approach to alleviatin...",3,2019,economics
4,983,Esther,Duflo,"""for their experimental approach to alleviatin...",3,2019,economics
...,...,...,...,...,...,...,...
945,569,Sully,Prudhomme,"""in special recognition of his poetic composit...",1,1901,literature
946,462,Henry,Dunant,"""for his humanitarian efforts to help wounded ...",2,1901,peace
947,463,Frédéric,Passy,"""for his lifelong work for international peace...",2,1901,peace
948,1,Wilhelm Conrad,Röntgen,"""in recognition of the extraordinary services ...",1,1901,physics
949,293,Emil,von Behring,"""for his work on serum therapy, especially its...",1,1901,medicine

#### 12.1.2 DataFrame을 JSON 파일로 내보내기

In [16]:
winners.head(2)

,id,firstname,surname,motivation,share,year,category
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3,2019,chemistry
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3,2019,chemistry

In [17]:
# 파일 생성 전 미리 출력 확인
winners.head(2).to_json(orient="records")

'[{"id":"976","firstname":"John","surname":"Goodenough","motivation":"\\"for the development of lithium-ion batteries\\"","share":"3","year":"2019","category":"chemistry"},{"id":"977","firstname":"M. Stanley","surname":"Whittingham","motivation":"\\"for the development of lithium-ion batteries\\"","share":"3","year":"2019","category":"chemistry"}]'

In [18]:
winners.to_json("winners.json", orient="records")

## 12.2 CSV 파일 읽고 쓰기

In [19]:
url = "https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv"
baby_names = pd.read_csv(url)
baby_names.head()

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42
3           2011  FEMALE  HISPANIC            GISELLE     38    51
4           2011  FEMALE  HISPANIC              GRACE     36    53

In [20]:
# 파일 생성 전 미리 출력 확인
baby_names.head(10).to_csv()

",Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank\r\n0,2011,FEMALE,HISPANIC,GERALDINE,13,75\r\n1,2011,FEMALE,HISPANIC,GIA,21,67\r\n2,2011,FEMALE,HISPANIC,GIANNA,49,42\r\n3,2011,FEMALE,HISPANIC,GISELLE,38,51\r\n4,2011,FEMALE,HISPANIC,GRACE,36,53\r\n5,2011,FEMALE,HISPANIC,GUADALUPE,26,62\r\n6,2011,FEMALE,HISPANIC,HAILEY,126,8\r\n7,2011,FEMALE,HISPANIC,HALEY,14,74\r\n8,2011,FEMALE,HISPANIC,HANNAH,17,71\r\n9,2011,FEMALE,HISPANIC,HAYLEE,17,71\r\n"

In [21]:
# 출력값에서 인덱스 제외
baby_names.head(10).to_csv(index=False)

"Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank\r\n2011,FEMALE,HISPANIC,GERALDINE,13,75\r\n2011,FEMALE,HISPANIC,GIA,21,67\r\n2011,FEMALE,HISPANIC,GIANNA,49,42\r\n2011,FEMALE,HISPANIC,GISELLE,38,51\r\n2011,FEMALE,HISPANIC,GRACE,36,53\r\n2011,FEMALE,HISPANIC,GUADALUPE,26,62\r\n2011,FEMALE,HISPANIC,HAILEY,126,8\r\n2011,FEMALE,HISPANIC,HALEY,14,74\r\n2011,FEMALE,HISPANIC,HANNAH,17,71\r\n2011,FEMALE,HISPANIC,HAYLEE,17,71\r\n"

In [22]:
baby_names.to_csv("NYC_Baby_Names.csv", index = False)

In [23]:
baby_names.to_csv("NYC_Baby_Names_.csv", index = False, columns = ["Gender", "Child's First Name", "Count"])

## 12.3 엑셀 통합문서에 읽고 쓰기

In [24]:
pd.read_excel("../../DATA/Single Worksheet.xlsx")

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [25]:
pd.read_excel(io="../../DATA/Single Worksheet.xlsx",
             usecols=["City", "First Name", "Last Name"],
             index_col="City")

              First Name Last Name
City
Miami            Brandon     James
Denver              Sean   Hawkins
Los Angeles         Judy       Day
San Francisco     Ashley      Ruiz
Portland       Stephanie     Gomez

In [26]:
pd.read_excel("../../DATA/Multiple Worksheets.xlsx",)

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [27]:
# 모든 워크시트 가져오기 - None (결과 : dict)
workbook = pd.read_excel("../../DATA/Multiple Worksheets.xlsx", sheet_name=None)
workbook

{'Data 1':   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 'Data 2':   First Name Last Name           City Gender
 0     Parker     Power        Raleigh      F
 1    Preston  Prescott   Philadelphia      F
 2    Ronaldo   Donaldo         Bangor      M
 3      Megan   Stiller  San Francisco      M
 4     Bustin    Jieber         Austin      F,
 'Data 3':   First Name  Last Name     City Gender
 0     Robert     Miller  Seattle      M
 1       Tara     Garcia  Phoenix      F
 2    Raphael  Rodriguez  Orlando      M}

In [28]:
type(workbook)

dict

In [29]:
workbook['Data 3']

  First Name  Last Name     City Gender
0     Robert     Miller  Seattle      M
1       Tara     Garcia  Phoenix      F
2    Raphael  Rodriguez  Orlando      M

In [30]:
# 'Data 1', 'Data 3' 워크시트 가져오기 - 라벨로 (결과 : dict)
pd.read_excel("../../DATA/Multiple Worksheets.xlsx", sheet_name=['Data 1', 'Data 3'])

{'Data 1':   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 'Data 3':   First Name  Last Name     City Gender
 0     Robert     Miller  Seattle      M
 1       Tara     Garcia  Phoenix      F
 2    Raphael  Rodriguez  Orlando      M}

In [31]:
# 'Data 1', 'Data 3' 워크시트 가져오기 - 인덱스로 (결과 : dict)
pd.read_excel("../../DATA/Multiple Worksheets.xlsx", sheet_name=[0, 2])

{0:   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 2:   First Name  Last Name     City Gender
 0     Robert     Miller  Seattle      M
 1       Tara     Garcia  Phoenix      F
 2    Raphael  Rodriguez  Orlando      M}

## 12.3.3 엑셀 통합문서 내보내기

In [32]:
baby_names.head()

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42
3           2011  FEMALE  HISPANIC            GISELLE     38    51
4           2011  FEMALE  HISPANIC              GRACE     36    53

In [33]:
girls = baby_names[baby_names["Gender"] == "FEMALE"]
boys = baby_names[baby_names["Gender"] == "MALE"]

- ExcelWriter 객체 생성, 저장

In [34]:
excel_file = pd.ExcelWriter("Baby_Names.xlsx")
excel_file

- DF.to_excel() 메서드에 ExcelWriter 객체 넘기기 (DataFrame에 ExcelWriter 연결하기)

In [35]:
# ExcelWriter 객체를 girls DataFrame 에 연결한 것
girls.to_excel(excel_writer=excel_file, sheet_name="Girls", index=False)

- ExcelWriter 객체 종료 (동시에 저장)

In [36]:
# save() 메서드는 deprecated. 
# 대신, close() 메서드를 쓰면 된다.
excel_file.close()

## 12.4 코딩 챌린지

In [37]:
tv_shows_file = "../../DATA/tv_shows.json"

In [38]:
tv_shows_json = pd.read_json(tv_shows_file)
tv_shows_json

                                               shows
0  {'show': 'The X-Files', 'runtime': 60, 'networ...
1  {'show': 'Lost', 'runtime': 60, 'network': 'AB...
2  {'show': 'Buffy the Vampire Slayer', 'runtime'...

1. shows 열의 각 딕셔너리에 중첩된 에피소드 데이터를 정규화하세요. 각 에피소드를 별도의 행으로 나타내는 DataFrame을 생성하세요. 각 행에는 에피소드와 관련된 메타데이터(season, episode, name, air_date)와 최상위 정보(show, runtime, network)가 포함되어야 합니다.

In [43]:
tv_shows = pd.json_normalize(tv_shows_json["shows"], record_path="episodes", meta=["show", "runtime", "network"])
tv_shows

,season,episode,name,air_date,show,runtime,network
0,1,1,Pilot,1993-09-11 01:00:00,The X-Files,60,FOX
1,1,2,Deep Throat,1993-09-18 01:00:00,The X-Files,60,FOX
2,1,3,Squeeze,1993-09-25 01:00:00,The X-Files,60,FOX
3,1,4,Conduit,1993-10-02 01:00:00,The X-Files,60,FOX
4,1,5,The Jersey Devil,1993-10-09 01:00:00,The X-Files,60,FOX
...,...,...,...,...,...,...,...
477,7,18,Dirty Girls,2003-04-16 00:00:00,Buffy the Vampire Slayer,60,UPN
478,7,19,Empty Places,2003-04-30 00:00:00,Buffy the Vampire Slayer,60,UPN
479,7,20,Touched,2003-05-07 00:00:00,Buffy the Vampire Slayer,60,UPN
480,7,21,End of Days,2003-05-14 00:00:00,Buffy the Vampire Slayer,60,UPN
481,7,22,Chosen,2003-05-21 00:00:00,Buffy the Vampire Slayer,60,UPN

2. 정규화된 데이터셋을 각 프로그램('The X-Files', 'Lost', 'Buffy the Vampire Slayer')별로 하나씩 총 3개의 개별 DataFrame으로 필터링하세요.

In [45]:
tv_shows.show.unique()

array(['The X-Files', 'Lost', 'Buffy the Vampire Slayer'], dtype=object)

In [44]:
xFiles = tv_shows[tv_shows["show"] == "The X-Files"]
xFiles

,season,episode,name,air_date,show,runtime,network
0,1,1,Pilot,1993-09-11 01:00:00,The X-Files,60,FOX
1,1,2,Deep Throat,1993-09-18 01:00:00,The X-Files,60,FOX
2,1,3,Squeeze,1993-09-25 01:00:00,The X-Files,60,FOX
3,1,4,Conduit,1993-10-02 01:00:00,The X-Files,60,FOX
4,1,5,The Jersey Devil,1993-10-09 01:00:00,The X-Files,60,FOX
...,...,...,...,...,...,...,...
213,11,6,Kitten,2018-02-08 01:00:00,The X-Files,60,FOX
214,11,7,Rm9sbG93ZXJz,2018-03-01 01:00:00,The X-Files,60,FOX
215,11,8,Familiar,2018-03-08 01:00:00,The X-Files,60,FOX
216,11,9,Nothing Lasts Forever,2018-03-15 00:00:00,The X-Files,60,FOX
217,11,10,My Struggle IV,2018-03-22 00:00:00,The X-Files,60,FOX

In [46]:
lost = tv_shows[tv_shows["show"] == "Lost"]
lost

,season,episode,name,air_date,show,runtime,network
218,1,1,Pilot (1),2004-09-23 00:00:00,Lost,60,ABC
219,1,2,Pilot (2),2004-09-30 00:00:00,Lost,60,ABC
220,1,3,Tabula Rasa,2004-10-07 00:00:00,Lost,60,ABC
221,1,4,Walkabout,2004-10-14 00:00:00,Lost,60,ABC
222,1,5,White Rabbit,2004-10-21 00:00:00,Lost,60,ABC
...,...,...,...,...,...,...,...
334,6,14,The Candidate,2010-05-05 01:00:00,Lost,60,ABC
335,6,15,Across the Sea,2010-05-12 01:00:00,Lost,60,ABC
336,6,16,What They Died For,2010-05-19 01:00:00,Lost,60,ABC
337,6,17,The End (1),2010-05-24 01:00:00,Lost,60,ABC
338,6,18,The End (2),2010-05-24 01:00:00,Lost,60,ABC

In [47]:
buffy = tv_shows[tv_shows["show"] == "Buffy the Vampire Slayer"]
buffy

,season,episode,name,air_date,show,runtime,network
339,1,1,Welcome to the Hellmouth,1997-03-11 01:00:00,Buffy the Vampire Slayer,60,UPN
340,1,2,The Harvest,1997-03-11 01:00:00,Buffy the Vampire Slayer,60,UPN
341,1,3,Witch,1997-03-18 01:00:00,Buffy the Vampire Slayer,60,UPN
342,1,4,Teacher's Pet,1997-03-26 01:00:00,Buffy the Vampire Slayer,60,UPN
343,1,5,Never Kill a Boy on the First Date,1997-04-01 01:00:00,Buffy the Vampire Slayer,60,UPN
...,...,...,...,...,...,...,...
477,7,18,Dirty Girls,2003-04-16 00:00:00,Buffy the Vampire Slayer,60,UPN
478,7,19,Empty Places,2003-04-30 00:00:00,Buffy the Vampire Slayer,60,UPN
479,7,20,Touched,2003-05-07 00:00:00,Buffy the Vampire Slayer,60,UPN
480,7,21,End of Days,2003-05-14 00:00:00,Buffy the Vampire Slayer,60,UPN
481,7,22,Chosen,2003-05-21 00:00:00,Buffy the Vampire Slayer,60,UPN

In [48]:
type(buffy)

pandas.core.frame.DataFrame

3. 3개의 DataFrame을 episode.xlsx 엑셀 통합문서로 작성하고 각 TV 프로그램의 에피소드 데이터를 별도의 워크시트에 저장하세요.  
   이때 워크시트의 이름은 자유롭게 설정하세요.